src/cf/Documents/мвв_ДСП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<Name>мвв_ДСП</Name>
			<BasedOn>
				<xr:Item>Document.мвв_ПредварительныйРасчет</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.мвв_Посредники</xr:Item>
				<xr:Item>InformationRegister.мвв_ГрафикПлатежей</xr:Item>
				<xr:Item>InformationRegister.мвв_Водители</xr:Item>
				<xr:Item>InformationRegister.мвв_ОбъектыИРиски</xr:Item>
				<xr:Item>InformationRegister.мвв_ДСП</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВариантВступленияВСилу</Name>
					<Type>
						<v8:Type>cfg:EnumRef.мвв_ВариантыВступленияВСилу</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаОтветственности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияОтветственности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Срок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.мвв_СтатусыДоговора</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.мвв_ПредварительныйРасчет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойПосредник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.мвв_Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Страхователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.мвв_Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтраховойПродукт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.мвв_СтраховыеПродуктыДСП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияПродукта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.мвв_ВерсииСтраховыхПродуктовДСП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДоговора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсВалюты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КратностьВалюты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПремияПоДокументу</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СвойстваДоговора</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Раздел</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.мвв_РазделыСвойствОбъектов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.мвв_СвойстваОбъектов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеСвойства</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.мвв_СвойстваОбъектов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОбъектыИРиски</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Объект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.мвв_ОбъектыСтрахования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Риск</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.мвв_СтраховыеРиски</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтраховаяСумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтраховаяПремия</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипФрнашищы</Name>
							<Type>
								<v8:Type>cfg:EnumRef.мвв_ТипыФраншизы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаФраншизы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ГрафикПлатежей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаОплаты</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КрайняяДатаОплаты</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Водители</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.мвв_Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументВУ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Возраст</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стаж</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Посредники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Посредник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.мвв_Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АгентскийДогвоор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Объект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.мвв_ОбъектыСтрахования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Риск</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.мвв_СтраховыеРиски</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентКВ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПремии</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКВ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПериодыИспользования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Срок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/InformationRegisters/мвв_ДСП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>мвв_ДСП</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВариантВступленияВСилу</Name>
					<Type>
						<v8:Type>cfg:EnumRef.мвв_ВариантыВступленияВСилу</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачалаОтветственности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончанияОтветственности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Срок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.мвв_СтатусыДоговора</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Страхователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.мвв_Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВерсияПродукта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.мвв_ВерсииСтраховыхПродуктовДСП</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютаДоговора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КурсВалюты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КратностьВалюты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.мвв_ДСП</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Documents/мвв_ДСП/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр мвв_ДСП
	Движения.мвв_ДСП.Записывать = Истина;
	Движение = Движения.мвв_ДСП.Добавить();
	Движение.Период = Дата;
	Движение.Договор = Ссылка;
	Движение.ВариантВступленияВСилу = ВариантВступленияВСилу;
	Движение.ДатаНачалаОтветственности = ДатаНачалаОтветственности;
	Движение.ДатаОкончанияОтветственности = ДатаОкончанияОтветственности;
	Движение.Срок = Срок;
	Движение.Статус = Статус;
	Движение.Страхователь = Страхователь;
	Движение.ВерсияПродукта = ВерсияПродукта;
	Движение.ВалютаДоговора = ВалютаДоговора;
	Движение.КурсВалюты = КурсВалюты;
	Движение.КратностьВалюты = КратностьВалюты;

	// регистр мвв_ОбъектыИРиски
	Движения.мвв_ОбъектыИРиски.Записывать = Истина;
	Для Каждого ТекСтрокаОбъектыИРиски Из ОбъектыИРиски Цикл
		Движение = Движения.мвв_ОбъектыИРиски.Добавить();
		Движение.Период = Дата;
		Движение.Договор = Ссылка;
		Движение.Объект = ТекСтрокаОбъектыИРиски.Объект;
		Движение.Риск = ТекСтрокаОбъектыИРиски.Риск;
		Движение.Валюта = ВалютаДоговора;
		Движение.СтраховаяСумма = ТекСтрокаОбъектыИРиски.СтраховаяСумма;
		Движение.СтраховаяПремия = ТекСтрокаОбъектыИРиски.СтраховаяПремия;
		Движение.ТипФраншизы = ТекСтрокаОбъектыИРиски.ТипФрнашищы;
		Движение.СуммаФраншизы = ТекСтрокаОбъектыИРиски.СуммаФраншизы;
	КонецЦикла;

	// регистр мвв_ГрафикПлатежей
	Движения.мвв_ГрафикПлатежей.Записывать = Истина;
	Для Каждого ТекСтрокаГрафикПлатежей Из ГрафикПлатежей Цикл
		Движение = Движения.мвв_ГрафикПлатежей.Добавить();
		Движение.Период = Дата;
		Движение.Договор = Ссылка;
		Движение.ДатаОплаты = ТекСтрокаГрафикПлатежей.ДатаОплаты;
		Движение.СуммаОплаты = ТекСтрокаГрафикПлатежей.Сумма;
	КонецЦикла;

	// регистр мвв_Водители
	Движения.мвв_Водители.Записывать = Истина;
	Для Каждого ТекСтрокаВодители Из Водители Цикл
		Движение = Движения.мвв_Водители.Добавить();
		Движение.Период = Дата;
		Движение.Договор = Ссылка;
		Движение.Водитель = ТекСтрокаВодители.Контрагент;
		Движение.ДокументВУ = ТекСтрокаВодители.ДокументВУ;
		Движение.Возраст = ТекСтрокаВодители.Возраст;
		Движение.Стаж = ТекСтрокаВодители.Стаж;
	КонецЦикла;

	// регистр мвв_Посредники
	Движения.мвв_Посредники.Записывать = Истина;
	Для Каждого ТекСтрокаПосредники Из Посредники Цикл
		Движение = Движения.мвв_Посредники.Добавить();
		Движение.Период = Дата;
		Движение.Договор = Ссылка;
		Движение.Посредник = ОсновнойПосредник;
		Движение.ПроцентКомиссии = ТекСтрокаПосредники.ПроцентКВ;
		Движение.СуммаКомиссии = ТекСтрокаПосредники.СуммаКВ;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(ДанныеЗаполнения) И ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.мвв_ПредварительныйРасчет") Тогда
		Если ТекущаяДата() > ДанныеЗаполнения.ДействуетДо Тогда
			ОбщегоНазначения.СообщитьПользователю("Данный расчет устарел. Его необходимо пересчитать");
			Возврат;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения, , "Дата, Номер, Проведен");
	КонецЕсли;  
	ЭтотОбъект.ДокументОснование = ДанныеЗаполнения;
	ЭтотОбъект.СтраховойПродукт	 = ЭтотОбъект.ВерсияПродукта.Владелец; 
	ЭтотОбъект.ПремияПоДокументу = ДанныеЗаполнения.СуммаПремии;
	Для каждого тСтрока ИЗ ДанныеЗаполнения.ДанныеДляРасчета Цикл
		тНовСтрока = ЭтотОбъект.СвойстваДоговора.Добавить();
		ЗаполнитьЗначенияСвойств(тНовСтрока, тСтрока);
		Если тСтрока.Свойство.Наименование = "Страхователь" Тогда
			ЭтотОбъект.Страхователь = тСтрока.ЗначениеСвойства;
		КонецЕсли;
		Если тСтрока.Свойство.Наименование = "Дата начала" Тогда
			ЭтотОбъект.ДатаНачалаОтветственности = тСтрока.ЗначениеСвойства;
		КонецЕсли;
		Если тСтрока.Свойство.Наименование = "Дата окончания" Тогда
			ЭтотОбъект.ДатаОкончанияОтветственности = тСтрока.ЗначениеСвойства;
		КонецЕсли;
	КонецЦикла;	 
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ВалютаДоговора) Тогда
		ЭтотОбъект.ВалютаДоговора = Константы.ВалютаРегламентированногоУчета.Получить();
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.КурсВалюты) Тогда
		ЭтотОбъект.КурсВалюты = 1;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.КратностьВалюты) тогда
		ЭтотОбъект.КратностьВалюты = 1;
	КонецЕсли;
КонецПроцедуры
